from_main_page = ("Ми не знайшли посилку за таким номером. "
                  "Якщо ви шукаєте інформацію про посилку, якій більше 3 місяців, "
                  "будь ласка, зверніться у контакт-центр: 0 800 500 609")

from_wrong_format_page = ("Ми не знайшли посилку за таким номером. "
                          "Можливо, вона ще не передана для відправлення, або номер некоректний. "
                          "Перевірте, чи відповідає вказаний номер можливому формату: "
                          "59500000031324 або AENM0002497278NPI.")
